---
type: DocumentPrintingEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# DocumentPrintingEventArgs

`Autodesk.Revit.DB.Events.DocumentPrintingEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetSettings | 2010 | `public IPrintSetting GetSettings ()` |
| Method | GetViewElementIds | 2010 | `public IList < ElementId > GetViewElementIds ()` |